###################################################################

# Created by write_sdc on Thu Nov  9 11:34:02 2023

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 0.05 [get_ports g1290]
set_load -pin_load 0.05 [get_ports g1293]
set_load -pin_load 0.05 [get_ports g2584]
set_load -pin_load 0.05 [get_ports g3222]
set_load -pin_load 0.05 [get_ports g3600]
set_load -pin_load 0.05 [get_ports g4098]
set_load -pin_load 0.05 [get_ports g4099]
set_load -pin_load 0.05 [get_ports g4100]
set_load -pin_load 0.05 [get_ports g4101]
set_load -pin_load 0.05 [get_ports g4102]
set_load -pin_load 0.05 [get_ports g4103]
set_load -pin_load 0.05 [get_ports g4104]
set_load -pin_load 0.05 [get_ports g4105]
set_load -pin_load 0.05 [get_ports g4106]
set_load -pin_load 0.05 [get_ports g4107]
set_load -pin_load 0.05 [get_ports g4108]
set_load -pin_load 0.05 [get_ports g4109]
set_load -pin_load 0.05 [get_ports g4110]
set_load -pin_load 0.05 [get_ports g4112]
set_load -pin_load 0.05 [get_ports g4121]
set_load -pin_load 0.05 [get_ports g4307]
set_load -pin_load 0.05 [get_ports g4321]
set_load -pin_load 0.05 [get_ports g4422]
set_load -pin_load 0.05 [get_ports g4809]
set_load -pin_load 0.05 [get_ports g5137]
set_load -pin_load 0.05 [get_ports g5468]
set_load -pin_load 0.05 [get_ports g5469]
set_load -pin_load 0.05 [get_ports g5692]
set_load -pin_load 0.05 [get_ports g6282]
set_load -pin_load 0.05 [get_ports g6284]
set_load -pin_load 0.05 [get_ports g6360]
set_load -pin_load 0.05 [get_ports g6362]
set_load -pin_load 0.05 [get_ports g6364]
set_load -pin_load 0.05 [get_ports g6366]
set_load -pin_load 0.05 [get_ports g6368]
set_load -pin_load 0.05 [get_ports g6370]
set_load -pin_load 0.05 [get_ports g6372]
set_load -pin_load 0.05 [get_ports g6374]
set_load -pin_load 0.05 [get_ports g6728]
set_max_fanout 20 [get_ports VDD]
set_max_fanout 20 [get_ports CK]
set_max_fanout 20 [get_ports g102]
set_max_fanout 20 [get_ports g107]
set_max_fanout 20 [get_ports g22]
set_max_fanout 20 [get_ports g23]
set_max_fanout 20 [get_ports g301]
set_max_fanout 20 [get_ports g306]
set_max_fanout 20 [get_ports g310]
set_max_fanout 20 [get_ports g314]
set_max_fanout 20 [get_ports g319]
set_max_fanout 20 [get_ports g32]
set_max_fanout 20 [get_ports g36]
set_max_fanout 20 [get_ports g37]
set_max_fanout 20 [get_ports g38]
set_max_fanout 20 [get_ports g39]
set_max_fanout 20 [get_ports g40]
set_max_fanout 20 [get_ports g41]
set_max_fanout 20 [get_ports g42]
set_max_fanout 20 [get_ports g44]
set_max_fanout 20 [get_ports g45]
set_max_fanout 20 [get_ports g46]
set_max_fanout 20 [get_ports g47]
set_max_fanout 20 [get_ports g557]
set_max_fanout 20 [get_ports g558]
set_max_fanout 20 [get_ports g559]
set_max_fanout 20 [get_ports g560]
set_max_fanout 20 [get_ports g561]
set_max_fanout 20 [get_ports g562]
set_max_fanout 20 [get_ports g563]
set_max_fanout 20 [get_ports g564]
set_max_fanout 20 [get_ports g567]
set_max_fanout 20 [get_ports g639]
set_max_fanout 20 [get_ports g702]
set_max_fanout 20 [get_ports g705]
set_max_fanout 20 [get_ports g89]
set_max_fanout 20 [get_ports g94]
set_max_fanout 20 [get_ports g98]
set_ideal_network [get_ports CK]
create_clock [get_ports CK]  -period 10  -waveform {0 5}
set_clock_latency 0.5  [get_clocks CK]
set_clock_uncertainty 0.1  [get_clocks CK]
set_input_delay -clock CK  5  [get_ports CK]
set_input_delay -clock CK  5  [get_ports VDD]
set_input_delay -clock CK  5  [get_ports g102]
set_input_delay -clock CK  5  [get_ports g107]
set_input_delay -clock CK  5  [get_ports g22]
set_input_delay -clock CK  5  [get_ports g23]
set_input_delay -clock CK  5  [get_ports g301]
set_input_delay -clock CK  5  [get_ports g306]
set_input_delay -clock CK  5  [get_ports g310]
set_input_delay -clock CK  5  [get_ports g314]
set_input_delay -clock CK  5  [get_ports g319]
set_input_delay -clock CK  5  [get_ports g32]
set_input_delay -clock CK  5  [get_ports g36]
set_input_delay -clock CK  5  [get_ports g37]
set_input_delay -clock CK  5  [get_ports g38]
set_input_delay -clock CK  5  [get_ports g39]
set_input_delay -clock CK  5  [get_ports g40]
set_input_delay -clock CK  5  [get_ports g41]
set_input_delay -clock CK  5  [get_ports g42]
set_input_delay -clock CK  5  [get_ports g44]
set_input_delay -clock CK  5  [get_ports g45]
set_input_delay -clock CK  5  [get_ports g46]
set_input_delay -clock CK  5  [get_ports g47]
set_input_delay -clock CK  5  [get_ports g557]
set_input_delay -clock CK  5  [get_ports g558]
set_input_delay -clock CK  5  [get_ports g559]
set_input_delay -clock CK  5  [get_ports g560]
set_input_delay -clock CK  5  [get_ports g561]
set_input_delay -clock CK  5  [get_ports g562]
set_input_delay -clock CK  5  [get_ports g563]
set_input_delay -clock CK  5  [get_ports g564]
set_input_delay -clock CK  5  [get_ports g567]
set_input_delay -clock CK  5  [get_ports g639]
set_input_delay -clock CK  5  [get_ports g702]
set_input_delay -clock CK  5  [get_ports g705]
set_input_delay -clock CK  5  [get_ports g89]
set_input_delay -clock CK  5  [get_ports g94]
set_input_delay -clock CK  5  [get_ports g98]
set_output_delay -clock CK  5  [get_ports g1290]
set_output_delay -clock CK  5  [get_ports g1293]
set_output_delay -clock CK  5  [get_ports g2584]
set_output_delay -clock CK  5  [get_ports g3222]
set_output_delay -clock CK  5  [get_ports g3600]
set_output_delay -clock CK  5  [get_ports g4098]
set_output_delay -clock CK  5  [get_ports g4099]
set_output_delay -clock CK  5  [get_ports g4100]
set_output_delay -clock CK  5  [get_ports g4101]
set_output_delay -clock CK  5  [get_ports g4102]
set_output_delay -clock CK  5  [get_ports g4103]
set_output_delay -clock CK  5  [get_ports g4104]
set_output_delay -clock CK  5  [get_ports g4105]
set_output_delay -clock CK  5  [get_ports g4106]
set_output_delay -clock CK  5  [get_ports g4107]
set_output_delay -clock CK  5  [get_ports g4108]
set_output_delay -clock CK  5  [get_ports g4109]
set_output_delay -clock CK  5  [get_ports g4110]
set_output_delay -clock CK  5  [get_ports g4112]
set_output_delay -clock CK  5  [get_ports g4121]
set_output_delay -clock CK  5  [get_ports g4307]
set_output_delay -clock CK  5  [get_ports g4321]
set_output_delay -clock CK  5  [get_ports g4422]
set_output_delay -clock CK  5  [get_ports g4809]
set_output_delay -clock CK  5  [get_ports g5137]
set_output_delay -clock CK  5  [get_ports g5468]
set_output_delay -clock CK  5  [get_ports g5469]
set_output_delay -clock CK  5  [get_ports g5692]
set_output_delay -clock CK  5  [get_ports g6282]
set_output_delay -clock CK  5  [get_ports g6284]
set_output_delay -clock CK  5  [get_ports g6360]
set_output_delay -clock CK  5  [get_ports g6362]
set_output_delay -clock CK  5  [get_ports g6364]
set_output_delay -clock CK  5  [get_ports g6366]
set_output_delay -clock CK  5  [get_ports g6368]
set_output_delay -clock CK  5  [get_ports g6370]
set_output_delay -clock CK  5  [get_ports g6372]
set_output_delay -clock CK  5  [get_ports g6374]
set_output_delay -clock CK  5  [get_ports g6728]
