###################################################################

# Created by write_sdc on Thu Oct 26 12:37:58 2023

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 0.05 [get_ports G855]
set_load -pin_load 0.05 [get_ports G856]
set_load -pin_load 0.05 [get_ports G857]
set_load -pin_load 0.05 [get_ports G858]
set_load -pin_load 0.05 [get_ports G859]
set_load -pin_load 0.05 [get_ports G860]
set_load -pin_load 0.05 [get_ports G861]
set_load -pin_load 0.05 [get_ports G862]
set_load -pin_load 0.05 [get_ports G863]
set_load -pin_load 0.05 [get_ports G864]
set_load -pin_load 0.05 [get_ports G865]
set_load -pin_load 0.05 [get_ports G866]
set_load -pin_load 0.05 [get_ports G867]
set_load -pin_load 0.05 [get_ports G868]
set_load -pin_load 0.05 [get_ports G869]
set_load -pin_load 0.05 [get_ports G870]
set_load -pin_load 0.05 [get_ports G871]
set_load -pin_load 0.05 [get_ports G872]
set_load -pin_load 0.05 [get_ports G873]
set_load -pin_load 0.05 [get_ports G874]
set_load -pin_load 0.05 [get_ports G875]
set_load -pin_load 0.05 [get_ports G876]
set_load -pin_load 0.05 [get_ports G877]
set_load -pin_load 0.05 [get_ports G878]
set_load -pin_load 0.05 [get_ports G879]
set_load -pin_load 0.05 [get_ports G880]
set_max_fanout 20 [get_ports G1]
set_max_fanout 20 [get_ports G10]
set_max_fanout 20 [get_ports G11]
set_max_fanout 20 [get_ports G12]
set_max_fanout 20 [get_ports G13]
set_max_fanout 20 [get_ports G14]
set_max_fanout 20 [get_ports G15]
set_max_fanout 20 [get_ports G16]
set_max_fanout 20 [get_ports G17]
set_max_fanout 20 [get_ports G18]
set_max_fanout 20 [get_ports G19]
set_max_fanout 20 [get_ports G2]
set_max_fanout 20 [get_ports G20]
set_max_fanout 20 [get_ports G21]
set_max_fanout 20 [get_ports G22]
set_max_fanout 20 [get_ports G23]
set_max_fanout 20 [get_ports G24]
set_max_fanout 20 [get_ports G25]
set_max_fanout 20 [get_ports G26]
set_max_fanout 20 [get_ports G27]
set_max_fanout 20 [get_ports G28]
set_max_fanout 20 [get_ports G29]
set_max_fanout 20 [get_ports G3]
set_max_fanout 20 [get_ports G30]
set_max_fanout 20 [get_ports G31]
set_max_fanout 20 [get_ports G32]
set_max_fanout 20 [get_ports G33]
set_max_fanout 20 [get_ports G34]
set_max_fanout 20 [get_ports G35]
set_max_fanout 20 [get_ports G36]
set_max_fanout 20 [get_ports G37]
set_max_fanout 20 [get_ports G38]
set_max_fanout 20 [get_ports G39]
set_max_fanout 20 [get_ports G4]
set_max_fanout 20 [get_ports G40]
set_max_fanout 20 [get_ports G41]
set_max_fanout 20 [get_ports G42]
set_max_fanout 20 [get_ports G43]
set_max_fanout 20 [get_ports G44]
set_max_fanout 20 [get_ports G45]
set_max_fanout 20 [get_ports G46]
set_max_fanout 20 [get_ports G47]
set_max_fanout 20 [get_ports G48]
set_max_fanout 20 [get_ports G49]
set_max_fanout 20 [get_ports G5]
set_max_fanout 20 [get_ports G50]
set_max_fanout 20 [get_ports G51]
set_max_fanout 20 [get_ports G52]
set_max_fanout 20 [get_ports G53]
set_max_fanout 20 [get_ports G54]
set_max_fanout 20 [get_ports G55]
set_max_fanout 20 [get_ports G56]
set_max_fanout 20 [get_ports G57]
set_max_fanout 20 [get_ports G58]
set_max_fanout 20 [get_ports G59]
set_max_fanout 20 [get_ports G6]
set_max_fanout 20 [get_ports G60]
set_max_fanout 20 [get_ports G7]
set_max_fanout 20 [get_ports G8]
set_max_fanout 20 [get_ports G9]
